// .prettierrc.js
module.exports = {
  // Максимальная длина строки. Если строка превышает это значение, Prettier сделает перенос.
  printWidth: 80,

  // Ширина табуляции, выраженная в количестве пробелов.
  tabWidth: 2,

  // Использовать пробелы вместо символов табуляции.
  useTabs: false,

  // Добавлять точку с запятой в конце каждой строки.
  semi: true,

  // // Использовать одинарные кавычки вместо двойных.
  // singleQuote: true,

  // Добавлять запятую в конце списков (например, в объектах, массивах) при переносе на новую строку.
  trailingComma: "all",

  // Добавлять пробелы внутри фигурных скобок объектов.
  bracketSpacing: true,

  // Всегда оборачивать аргументы стрелочных функций в круглые скобки.
  arrowParens: "always",

  singleQuote: false,
  bracketSameLine: true,
};
